app/views/jobs/show.html.erb

SELECT "service_areas".* FROM "service_areas" WHERE "service_areas"."job_id" = ?  [["job_id", 4]]
---
  <p> <strong>Areas they service</strong> </p>
  <% @job.service_areas.each do |s| %>

SELECT "comments".* FROM "comments" WHERE "comments"."job_id" = ?  [["job_id", 3]]
---
    <p> Comments: </p>
      <% @job.comments.each do |c|%>