app/controllers/categories_controller.rb

  def show
    @category = Category.find(params[:id]).jobs
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]