app/controllers/comments_controller.rb

  def create
    @job = Job.find(params[:job_id])
    @job.comments.build(comments_params)
    if @job.save
---
INSERT INTO "comments" ("comments", "rating", "job_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["comments", "Made a good job"], ["rating", 8], ["job_id", 1], ["created_at", "2017-10-20 14:29:58.623688"], ["updated_at", "2017-10-20 14:29:58.623688"], ["user_id", 1]]
UPDATE "comments" SET "updated_at" = ?, "user_id" = ? WHERE "comments"."id" = ?  [["updated_at", "2017-10-20 14:15:46.919761"], ["user_id", 1], ["id", 3]]