app/controllers/jobs_controller.rb

INSERT INTO "service_areas" ("name", "job_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "sdsa"], ["job_id", 4], ["created_at", "2017-10-14 14:34:32.512941"], ["updated_at", "2017-10-14 14:34:32.512941"]]
---
  def create
    @jobs = Job.new(job_params)
    @jobs = current_user.jobs.build(job_params)
    @jobs = @jobs.service_areas.build
    binding.pry
    if @jobs.save